In [23]:
import pandas as pd 
from sqlalchemy import create_engine
# from postgres_password import pass_word

In [24]:
location_csv=pd.read_csv("data/country-capitals.csv")
location_csv.head()

,CountryName,CapitalName,CapitalLatitude,CapitalLongitude,CountryCode,ContinentName
0,Somaliland,Hargeisa,9.55,44.050000,NaN,Africa
1,South Georgia and South Sandwich Islands,King Edward Point,-54.283333,-36.500000,GS,Antarctica
2,French Southern and Antarctic Lands,Port-aux-Français,-49.35,70.216667,TF,Antarctica
3,Palestine,Jerusalem,31.76666667,35.233333,PS,Asia
4,Aland Islands,Mariehamn,60.116667,19.900000,AX,Europe

In [25]:
arrivals_csv=pd.read_csv("data/arrivals.csv")
arrivals_csv.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Aruba,ABW,"International tourism, number of arrivals",ST.INT.ARVL,NaN,NaN,NaN,NaN,NaN,NaN,...,1469000.0,1481000.0,1667000.0,1739000.0,1832000.0,1758000.0,1863000.0,1897000.0,1951000.0,NaN
1,Afghanistan,AFG,"International tourism, number of arrivals",ST.INT.ARVL,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Angola,AGO,"International tourism, number of arrivals",ST.INT.ARVL,NaN,NaN,NaN,NaN,NaN,NaN,...,481000.0,528000.0,650000.0,595000.0,592000.0,397000.0,261000.0,218000.0,218000.0,NaN
3,Albania,ALB,"International tourism, number of arrivals",ST.INT.ARVL,NaN,NaN,NaN,NaN,NaN,NaN,...,2932000.0,3514000.0,3256000.0,3673000.0,4131000.0,4736000.0,5118000.0,5927000.0,6406000.0,NaN
4,Andorra,AND,"International tourism, number of arrivals",ST.INT.ARVL,NaN,NaN,NaN,NaN,NaN,NaN,...,7983000.0,7900000.0,7676000.0,7797000.0,7850000.0,8025000.0,8152000.0,8328000.0,8235000.0,NaN

In [34]:
book_csv=pd.read_csv("data/Book1.csv")
book_csv.head()

          Country CountryCode CountryCode2   x
0     Afghanistan          AF          AFG   4
1         Albania          AL          ALB   8
2         Algeria          DZ          DZA  12
3  American Samoa          AS          ASM  16
4         Andorra          AD          AND  20

In [26]:
revenues_csv=pd.read_csv("data/revenues.csv")
revenues_csv.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Aruba,ABW,"International tourism, receipts (current US$)",ST.INT.RCPT.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,1.358000e+09,1.412000e+09,1.506000e+09,1.625000e+09,1.659000e+09,1.757000e+09,1.855000e+09,2.029000e+09,2.091000e+09,NaN
1,Afghanistan,AFG,"International tourism, receipts (current US$)",ST.INT.RCPT.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,1.650000e+08,1.670000e+08,1.790000e+08,1.210000e+08,8.600000e+07,6.200000e+07,1.600000e+07,5.000000e+07,8.500000e+07,NaN
2,Angola,AGO,"International tourism, receipts (current US$)",ST.INT.RCPT.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,6.530000e+08,7.110000e+08,1.241000e+09,1.597000e+09,1.171000e+09,6.280000e+08,8.840000e+08,5.570000e+08,3.950000e+08,NaN
3,Albania,ALB,"International tourism, receipts (current US$)",ST.INT.RCPT.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,1.833000e+09,1.623000e+09,1.670000e+09,1.849000e+09,1.613000e+09,1.821000e+09,2.050000e+09,2.306000e+09,2.458000e+09,NaN
4,Andorra,AND,"International tourism, receipts (current US$)",ST.INT.RCPT.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Cleaning data

In [27]:
clean_location_df=location_csv[["CountryName","CapitalLatitude","CapitalLongitude","CountryCode"]].dropna()
clean_location_df.head()

,CountryName,CapitalLatitude,CapitalLongitude,CountryCode
1,South Georgia and South Sandwich Islands,-54.283333,-36.500000,GS
2,French Southern and Antarctic Lands,-49.35,70.216667,TF
3,Palestine,31.76666667,35.233333,PS
4,Aland Islands,60.116667,19.900000,AX
5,Nauru,-0.5477,166.920867,NR

In [28]:
clean_location_df=clean_location_df.rename(columns={"CountryName":"Country","CapitalLatitude":"Latitude","CapitalLongitude":"Longitude"})
clean_location_df.head()

,Country,Latitude,Longitude,CountryCode
1,South Georgia and South Sandwich Islands,-54.283333,-36.500000,GS
2,French Southern and Antarctic Lands,-49.35,70.216667,TF
3,Palestine,31.76666667,35.233333,PS
4,Aland Islands,60.116667,19.900000,AX
5,Nauru,-0.5477,166.920867,NR

In [29]:
clean_arrivals_df=arrivals_csv[["Country Code","1995","1996","1997","1998","1999","2000","2001","2002","2003","2004","2005","2006","2007","2008","2009","2010","2011","2012","2013","2014","2015","2016","2017","2018","2019"]].dropna()
clean_arrivals_df

,Country Code,1995,1996,1997,1998,1999,2000,2001,2002,2003,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,ABW,9.120000e+05,9.570000e+05,9.470000e+05,9.060000e+05,9.720000e+05,1.211000e+06,1.178000e+06,1.225000e+06,1.184000e+06,...,1.394000e+06,1.469000e+06,1.481000e+06,1.667000e+06,1.739000e+06,1.832000e+06,1.758000e+06,1.863000e+06,1.897000e+06,1.951000e+06
2,AGO,9.000000e+03,2.100000e+04,4.500000e+04,5.200000e+04,4.500000e+04,5.100000e+04,6.700000e+04,9.100000e+04,1.070000e+05,...,4.250000e+05,4.810000e+05,5.280000e+05,6.500000e+05,5.950000e+05,5.920000e+05,3.970000e+05,2.610000e+05,2.180000e+05,2.180000e+05
3,ALB,3.040000e+05,2.870000e+05,1.190000e+05,1.840000e+05,3.710000e+05,3.170000e+05,3.540000e+05,4.700000e+05,5.570000e+05,...,2.417000e+06,2.932000e+06,3.514000e+06,3.256000e+06,3.673000e+06,4.131000e+06,4.736000e+06,5.118000e+06,5.927000e+06,6.406000e+06
5,ARB,3.023804e+07,3.055718e+07,3.169182e+07,3.356416e+07,3.784747e+07,4.140266e+07,4.260815e+07,4.867241e+07,5.160019e+07,...,1.005348e+08,8.465702e+07,9.457346e+07,9.451912e+07,1.007192e+08,9.675739e+07,9.498993e+07,1.013361e+08,1.091341e+08,1.160803e+08
7,ARG,2.289000e+06,2.614000e+06,2.764000e+06,3.012000e+06,2.898000e+06,2.909000e+06,2.620000e+06,2.820000e+06,2.995000e+06,...,6.800000e+06,6.703000e+06,6.497000e+06,6.510000e+06,7.165000e+06,6.816000e+06,6.668000e+06,6.711000e+06,6.942000e+06,7.399000e+06
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
256,VUT,8.200000e+04,1.030000e+05,8.100000e+04,7.800000e+04,9.600000e+04,1.060000e+05,1.060000e+05,9.900000e+04,1.020000e+05,...,2.377000e+05,2.489000e+05,3.210000e+05,3.570000e+05,3.290000e+05,2.870000e+05,3.510000e+05,3.330000e+05,3.500000e+05,2.560000e+05
257,WLD,1.024979e+09,1.082486e+09,1.130316e+09,1.145612e+09,1.188192e+09,1.262413e+09,1.231352e+09,1.252355e+09,1.234392e+09,...,1.667619e+09,1.700644e+09,1.784601e+09,1.852337e+09,1.909107e+09,1.966290e+09,2.031531e+09,2.135215e+09,2.221459e+09,2.280131e+09
261,ZAF,4.684000e+06,5.186000e+06,5.170000e+06,5.898000e+06,6.026000e+06,6.001000e+06,5.908000e+06,6.550000e+06,6.640000e+06,...,1.130300e+07,1.209700e+07,1.306900e+07,1.431800e+07,1.453000e+07,1.395200e+07,1.512100e+07,1.497500e+07,1.500400e+07,1.479700e+07
262,ZMB,1.630000e+05,2.640000e+05,3.410000e+05,3.620000e+05,4.040000e+05,4.570000e+05,4.920000e+05,5.650000e+05,4.130000e+05,...,8.150000e+05,9.200000e+05,8.590000e+05,9.150000e+05,9.470000e+05,9.320000e+05,9.560000e+05,1.009000e+06,1.072000e+06,1.266000e+06
263,ZWE,1.416000e+06,1.597000e+06,1.336000e+06,2.090000e+06,2.250000e+06,1.967000e+06,2.217000e+06,2.041000e+06,2.256000e+06,...,2.239000e+06,2.423000e+06,1.794000e+06,1.833000e+06,1.880000e+06,2.057000e+06,2.168000e+06,2.423000e+06,2.580000e+06,2.294000e+06

In [30]:
clean_arrivals_df=clean_arrivals_df.rename(columns={"1995":"Total_arrivals_1995","1996":"Total_arrivals_1996","1997":"Total_arrivals_1997","1998":"Total_arrivals_1998","1999":"Total_arrivals_1999","2000":"Total_arrivals_2000","2001":"Total_arrivals_2001","2002":"Total_arrivals_2002","2003":"Total_arrivals_2003","2004":"Total_arrivals_2004","2005":"Total_arrivals_2005","2006":"Total_arrivals_2006","2007":"Total_arrivals_2007","2008":"Total_arrivals_2008","2009":"Total_arrivals_2009","2010":"Total_arrivals_2010","2011":"Total_arrivals_2011","2012":"Total_arrivals_2012","2013":"Total_arrivals_2013","2014":"Total_arrivals_2014","2015":"Total_arrivals_2015","2016":"Total_arrivals_2017","2018":"Total_arrivals_2018","2019":"Total_arrivals_2019"})
clean_arrivals_df.head()

,Country Code,Total_arrivals_1995,Total_arrivals_1996,Total_arrivals_1997,Total_arrivals_1998,Total_arrivals_1999,Total_arrivals_2000,Total_arrivals_2001,Total_arrivals_2002,Total_arrivals_2003,...,Total_arrivals_2010,Total_arrivals_2011,Total_arrivals_2012,Total_arrivals_2013,Total_arrivals_2014,Total_arrivals_2015,Total_arrivals_2017,2017,Total_arrivals_2018,Total_arrivals_2019
0,ABW,912000.00,957000.00,947000.00,906000.00,972000.00,1211000.00,1178000.00,1225000.00,1184000.00,...,1394000.0,1469000.00,1481000.00,1667000.00,1739000.0,1832000.00,1758000.00,1863000.0,1897000.0,1951000.0
2,AGO,9000.00,21000.00,45000.00,52000.00,45000.00,51000.00,67000.00,91000.00,107000.00,...,425000.0,481000.00,528000.00,650000.00,595000.0,592000.00,397000.00,261000.0,218000.0,218000.0
3,ALB,304000.00,287000.00,119000.00,184000.00,371000.00,317000.00,354000.00,470000.00,557000.00,...,2417000.0,2932000.00,3514000.00,3256000.00,3673000.0,4131000.00,4736000.00,5118000.0,5927000.0,6406000.0
5,ARB,30238040.81,30557179.06,31691821.51,33564164.75,37847470.51,41402657.74,42608150.07,48672412.96,51600193.07,...,100534799.2,84657021.52,94573456.57,94519121.56,100719164.9,96757390.61,94989926.05,101336098.2,109134074.9,116080347.5
7,ARG,2289000.00,2614000.00,2764000.00,3012000.00,2898000.00,2909000.00,2620000.00,2820000.00,2995000.00,...,6800000.0,6703000.00,6497000.00,6510000.00,7165000.0,6816000.00,6668000.00,6711000.0,6942000.0,7399000.0

In [31]:
clean_revenues_df=revenues_csv[["Country Code","1995","1996","1997","1998","1999","2000","2001","2002","2003","2004","2005","2006","2007","2008","2009","2010","2011","2012","2013","2014","2015","2016","2017","2018","2019"]].dropna()
clean_revenues_df.head()

,Country Code,1995,1996,1997,1998,1999,2000,2001,2002,2003,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,ABW,5.540000e+08,6.660000e+08,7.260000e+08,7.860000e+08,7.820000e+08,8.500000e+08,8.250000e+08,8.350000e+08,8.581000e+08,...,1.254000e+09,1.358000e+09,1.412000e+09,1.506000e+09,1.625000e+09,1.659000e+09,1.757000e+09,1.855000e+09,2.029000e+09,2.091000e+09
2,AGO,2.700000e+07,3.800000e+07,2.400000e+07,3.900000e+07,3.100000e+07,3.400000e+07,3.500000e+07,5.100000e+07,6.300000e+07,...,7.260000e+08,6.530000e+08,7.110000e+08,1.241000e+09,1.597000e+09,1.171000e+09,6.280000e+08,8.840000e+08,5.570000e+08,3.950000e+08
3,ALB,7.000000e+07,9.400000e+07,3.400000e+07,6.000000e+07,2.180000e+08,3.980000e+08,4.510000e+08,4.920000e+08,5.370000e+08,...,1.778000e+09,1.833000e+09,1.623000e+09,1.670000e+09,1.849000e+09,1.613000e+09,1.821000e+09,2.050000e+09,2.306000e+09,2.458000e+09
6,ARE,6.320000e+08,7.430000e+08,8.140000e+08,8.590000e+08,8.930000e+08,1.063000e+09,1.200000e+09,1.332000e+09,1.438000e+09,...,8.577000e+09,9.204000e+09,1.092400e+10,1.238900e+10,1.522100e+10,1.748100e+10,1.949600e+10,2.104900e+10,2.137200e+10,3.841330e+10
7,ARG,2.550000e+09,2.975000e+09,3.153000e+09,3.353000e+09,3.175000e+09,3.195000e+09,2.756000e+09,1.716000e+09,2.306000e+09,...,5.605000e+09,6.058000e+09,5.665000e+09,5.199000e+09,5.645000e+09,5.441000e+09,5.466000e+09,5.830000e+09,5.999000e+09,5.654000e+09

In [32]:
clean_revenues_df=clean_revenues_df.rename(columns={"1995":"Total_revenues_1995","1996":"Total_revenues_1996","1997":"Total_revenues_1997","1998":"Total_revenues_1998","1999":"Total_revenues_1999","2000":"Total_revenues_2000","2001":"Total_revenues_2001","2002":"Total_revenues_2002","2003":"Total_revenues_2003","2004":"Total_revenues_2004","2005":"Total_revenues_2005","2006":"Total_revenues_2006","2007":"Total_revenues_2007","2008":"Total_revenues_2008","2009":"Total_revenues_2009","2010":"Total_revenues_2010","2011":"Total_revenues_2011","2012":"Total_revenues_2012","2013":"Total_revenues_2013","2014":"Total_revenues_2014","2015":"Total_revenues_2015","2016":"Total_revenues_2017","2018":"Total_revenues_2018","2019":"Total_revenues_2019"})
clean_revenues_df.head()

,Country Code,Total_revenues_1995,Total_revenues_1996,Total_revenues_1997,Total_revenues_1998,Total_revenues_1999,Total_revenues_2000,Total_revenues_2001,Total_revenues_2002,Total_revenues_2003,...,Total_revenues_2010,Total_revenues_2011,Total_revenues_2012,Total_revenues_2013,Total_revenues_2014,Total_revenues_2015,Total_revenues_2017,2017,Total_revenues_2018,Total_revenues_2019
0,ABW,5.540000e+08,6.660000e+08,7.260000e+08,7.860000e+08,7.820000e+08,8.500000e+08,8.250000e+08,8.350000e+08,8.581000e+08,...,1.254000e+09,1.358000e+09,1.412000e+09,1.506000e+09,1.625000e+09,1.659000e+09,1.757000e+09,1.855000e+09,2.029000e+09,2.091000e+09
2,AGO,2.700000e+07,3.800000e+07,2.400000e+07,3.900000e+07,3.100000e+07,3.400000e+07,3.500000e+07,5.100000e+07,6.300000e+07,...,7.260000e+08,6.530000e+08,7.110000e+08,1.241000e+09,1.597000e+09,1.171000e+09,6.280000e+08,8.840000e+08,5.570000e+08,3.950000e+08
3,ALB,7.000000e+07,9.400000e+07,3.400000e+07,6.000000e+07,2.180000e+08,3.980000e+08,4.510000e+08,4.920000e+08,5.370000e+08,...,1.778000e+09,1.833000e+09,1.623000e+09,1.670000e+09,1.849000e+09,1.613000e+09,1.821000e+09,2.050000e+09,2.306000e+09,2.458000e+09
6,ARE,6.320000e+08,7.430000e+08,8.140000e+08,8.590000e+08,8.930000e+08,1.063000e+09,1.200000e+09,1.332000e+09,1.438000e+09,...,8.577000e+09,9.204000e+09,1.092400e+10,1.238900e+10,1.522100e+10,1.748100e+10,1.949600e+10,2.104900e+10,2.137200e+10,3.841330e+10
7,ARG,2.550000e+09,2.975000e+09,3.153000e+09,3.353000e+09,3.175000e+09,3.195000e+09,2.756000e+09,1.716000e+09,2.306000e+09,...,5.605000e+09,6.058000e+09,5.665000e+09,5.199000e+09,5.645000e+09,5.441000e+09,5.466000e+09,5.830000e+09,5.999000e+09,5.654000e+09

In [38]:
clean_book_df=book_csv[["CountryCode","CountryCode2"]]
clean_book_df.head()

  CountryCode CountryCode2
0          AF          AFG
1          AL          ALB
2          DZ          DZA
3          AS          ASM
4          AD          AND

In [46]:
merge_loc_book_df= pd.merge(clean_location_df,clean_book_df,on="CountryCode")
loc_book_df=merge_loc_book_df.drop(["CountryCode"],axis=1).rename(columns={"CountryCode2":"CountryCode"})
loc_book_df.head()

,Country,Latitude,Longitude,CountryCode
0,South Georgia and South Sandwich Islands,-54.283333,-36.500000,SGS
1,French Southern and Antarctic Lands,-49.35,70.216667,ATF
2,Palestine,31.76666667,35.233333,PSE
3,Aland Islands,60.116667,19.900000,ALA
4,Nauru,-0.5477,166.920867,NRU

In [48]:
location=loc_book_df.to_csv("output/location.csv",index=False)
location